scheme/sicp-notes.org
* SICP
** Building Abstractions with Procedures
*** John Locke
 - combining several *simple ideas* into one combound one
 - bringing two ideas without uniting them into one, getting *relations*
 - separating them from all others ideas, this is called *abstraction*

*** Three Mechanisms
Every powerful language has three mechanism for accomplising simple ideas to form more complex ideas:
 - primitive expressions - the simplest entities
 - means of combination - built compound elements from simpler ones
 - means of abstraction - naming and manipulating compound elements as units

*** Prefix Notation
The convention of placing the operator to the lef of the operands in known as /prefix notation/.

(+ 10 5 8)

No ambiguity can arise, because the operator is always the leftmost element and the entire combination
is delimited by the parentheses.
