scheme/sicp-notes.tex
% Created 2024-12-31 Sal 12:09
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\author{B. Orçun Özkablan}
\date{\today}
\title{}
\hypersetup{
 pdfauthor={B. Orçun Özkablan},
 pdftitle={},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 29.4 (Org mode 9.6.15)}, 
 pdflang={English}}
\begin{document}

\tableofcontents

\section{SICP}
\label{sec:org272a81f}
\subsection{Building Abstractions with Procedures}
\label{sec:org5f9a24b}
\subsubsection{John Locke}
\label{sec:org7c3d047}
\begin{itemize}
\item combining several \textbf{simple ideas} into one combound one
\item bringing two ideas without uniting them into one, getting \textbf{relations}
\item separating them from all others ideas, this is called \textbf{abstraction}
\end{itemize}

\subsubsection{Three Mechanisms}
\label{sec:org664166f}
Every powerful language has three mechanism for accomplising simple ideas to form more complex ideas:
\begin{itemize}
\item primitive expressions - the simplest entities
\item means of combination - built compound elements from simpler ones
\item means of abstraction - naming and manipulating compound elements as units
\end{itemize}

\subsubsection{Prefix Notation}
\label{sec:org97d1a8f}
The convention of placing the operator to the lef of the operands in known as \emph{prefix notation}.

(+ 10 5 8)

No ambiguity can arise, because the operator is always the leftmost element and the entire combination
is delimited by the parentheses.
\end{document}
